{
  "Portfolio": "Portfolio",
  "five": "High five!",
  "contacts": "Contacts",
  "projects": "Projects",
  "achievementsTitle": "Achievements And Certifications",
  "achievements": [
    {
      "title": "Open regional championship \"Young professionals\" (WorldSkills Russia) in the Chelyabinsk region, web design and development",
      "content": [
        "2019 - Winner - juniors",
        "2020 - Prize Winner - Main Category"
      ]
    },
    {
      "title": "IT school samsung. Free mobile development education program for high school students.",
      "content": [
        "2018-2019 Academic Year"
      ]
    }
  ],
  "projectsArray": [
    {
      "title": "🏫💻 Faculty of ICT website",
      "descriptionShort": "The site is the hallmark of ITMO Faculty of ICT. The site should provide accessible information about the activities of the faculty, disciplines and teachers.",
      "descriptionLong": "<h4>✨ About the project</h4><p>The faculty of infocommunication technologies is the main starting point in the development of professional skills. The site is the hallmark of itmo faculty of ict. When going to the site, the entrant or his parents should have an understanding of what kind of faculty it is and what its specialization is. The site contains accessible information about the activities, information about disciplines and teachers. There are also pages for administration.</p> <p><strong>🗺  Map</strong></p> <p><strong>Basic</strong></p> <ul> <li>home</li> <ul> <li>articles</li> </ul> <li>events</li> <ul> <li>all news</li> <li>events, news, announcements</li> </ul> <li>for students</li> <ul> <li>articles</li> </ul> <li>admission</li> <ul> <li>list of directions for master's degree, bachelor's degree</li> <ul> <li>directions pages</li> <ul> <li>disciplines of the direction</li> </ul> </ul> </ul> <li>contacts</li> </ul> <p><strong>Admin panel</strong></p> <ul> <li>login page</li> <li>published</li> <ul> <li>editing</li> </ul> <li>create an entry</li> <li>favorites</li> <ul> <li>editing</li> </ul> <li>tags</li> </ul> <p><strong>🌟  Features</strong></p> <ul> <li>dark and light theme</li> <li>animation:</li> <ul> <li>spinning hexagons with text appearance</li> <li>carousel with popup oval with text</li> <li>an arrow moving along the road and passing the marks, reaching which the text appears. At the end of the road is a book that changes the position and text</li> <li>smooth appearance of the element when scrolling</li> <li>lines emerging from the sides of the page</li> <li>block with photos moving along ovals with hover effect</li> </ul> <li>admin:</li> <ul> <li>crop photos on upload</li> <li>changing the format of photos when previewing blocks (double and slider)</li> <li>preview of the post, preview of blocks for articles that will lead to the article itself on the pages</li> <li>six types of custom blocks in post creation (two blocks, text, image, slider, quote, subtitle)</li> <li>draggable blocks</li> </ul> <li>pagination, search, news filtering</li> <li>carousels:</li> <ul> <li>with oval blocks</li> <li>with 6 (4) images in two lines</li> <li>with 4 (2) zoom hover effect</li> <li>with 1 image and height adjusted to the first one in the queue</li> </ul> <li>expansion-panel with outgoing lines</li> </ul>"
    },
    {
      "title": "🖨️🐒 Website in retro style",
      "descriptionShort": "A site with a full-screen slider, the appearance of elements, various animations: an old typewriter, a monkey in a hat riding a unicycle along the emerging road, the appearance of an inscription, a hovering balloon.",
      "descriptionLong": "<h4>✨ About the project</h4><p>A site with a full-screen slider, the appearance of elements, various animations: an old typewriter, a monkey in a hat riding a unicycle along the emerging road, the appearance of an inscription, a hovering balloon.</p><h4>✨ Features</h4> <ul> <li>fullscreen content slider</li> <li>flying balloon animation</li> <li>lettering animation</li> <li>typewriter animation</li> <li>soaring notes</li> <li>animation of a monkey with a hat on a unicycle along an emerging track</li> <li>old phone animation</li> </ul>"
    },
    {
      "title": "📝📅  Project Control",
      "descriptionShort": "Create projects, search for participants for a certain position, divide tasks between them and view progress in a kanban board. Also join any other projects yourself.",
      "descriptionLong": "<h4>✨ About the project</h4> <p>Create projects, search for participants for a certain position, divide tasks between them and view progress in a kanban board. Also join any other projects yourself.</p> <p><strong>✨ Features</strong></p> <ul> <li>authorization, registration, profile change</li> <li>creating a project, adding roles to the project, searching for participants for these roles (applications from people or from the creator)</li> <li>beautiful kanban board for a project, adding and changing tasks, changing the status by task participant or project creator, marking burning tasks</li> <li>view (some with pagination)</li> <ul> <li>all projects with the ability to join it</li> <li>all users with the ability to add them to your projects</li> <li>your applications</li> <li>projects in which you are a member</li> </ul> <li>dark and light themes</li> <li>icons for users by the first letters of the name with a unique color</li> </ul>"
    },
    {
      "title": "🌥️❄️ Weather",
      "descriptionShort": "An application that shows the weather by geolocation or by the selected city in the settings. View the weather in other Russian cities and add them to your favorites (short and full report).",
      "descriptionLong": "<h4>✨ About the project</h4> <p>An application that shows the weather by geolocation or by the selected city in the settings. View the weather in other russian cities and add them to your favorites (short and full report).</p> <p><strong>✨ Features</strong></p> <ul> <li>weather display by geolocation or by a selected city in the settings</li> <li>weather search for russian cities, adding them to favorites</li> <li>complete weather report with the ability to view details by hour or day</li> <li>update information button</li> <li>skeleton loading</li> <li>tooltips with information description</li> <li>changing units</li> <li>different images for the weather</li> <li>pwa</li> </ul>"
    },
    {
      "title": "📝📅  Task tracker",
      "descriptionShort": "Create sprints, add tasks to them. Track the process by filtering by priority/title/creation date/deadline, or in the table by task status. If you are exhausted by a long list of tasks, just relax: look at the dogs.",
      "descriptionLong": "<h4>✨ About the project</h4><p>Create sprints, add tasks to them. Track the process by filtering by priority/title/creation date/deadline, or in the table by task status. If you are exhausted by a long list of tasks, just relax: look at the dogs.</p> <p><strong>✨</strong><strong> Features</strong></p> <ul> <li>create/edit tasks, sprints</li> <li>backlog page</li> <li>drag and drop tasks into a sprint</li> <li>sprints page: two types of sprint display:</li> <ul> <li>the first one is a list of all tasks filtered by priority, title, creation date, deadline</li> <li>the second is a tabular view of all tasks by task status</li> </ul> <li>using localstorage to save all project objects</li> <li>relax page with pictures and videos of dogs</li> </ul>"
    },
    {
      "title": "👨‍🔬🦹‍♂️ Rick and Morty",
      "descriptionShort": "Application showing information about characters, locations, episodes of Rick and Morty series with search, filtering, pagination. It will be easy for you to find information thanks to the links in each of the sections to specific places.",
      "descriptionLong": "<h4>✨ About the project</h4><p>Application showing information about characters, locations, episodes of Rick and Morty series with search, filtering, pagination. It will be easy for you to find information thanks to the links in each of the sections to specific places.</p><h4>✨ Features</h4> <ul> <li>shows some statistics about the total number of</li>  <ul> <li>characters</li> <li>locations</li> <li>episodes</li> </ul> <li>filtering, pagination, search</li> <li>light and dark theme</li> <li>pwa</li> </ul>"
    },
    {
      "title": "👩‍🎓📋 Super app for students",
      "descriptionShort": "Group course project. My made scheduling service with the ability to add homework, authorization, menu. Application adapted for mobile phones.",
      "descriptionLong": "<h4>✨ About the project</h4><p>Group course project. My made scheduling service with the ability to add homework, authorization, menu. Application adapted for mobile phones</p><h4>✨ Features</h4><ul><li>The schedule has the ability to select a date (a week for large screen gadgets, a day for phones) and display all the information that corresponds to that date. The table for gadgets with a large screen displays: in the headings of the table - days of the week, date; in the first column - the time of the lesson; in other cells information about the lesson. When you click on these cells, all information about the lesson is displayed in the modal. For mobile devices, a block with all days of the week and their dates is displayed. This is followed by blocks with information about the lesson, when clicked, the same modal appears as on devices with a large screen. If there are no lessons on the selected date, then there is a message about this.</li><li>Tool for adding homework. When you click on a lesson without homework, there should be a form for adding it with a text field for the task and a button for adding. Sending an empty value displays an error. When you click on a lesson with homework, it is displayed. There is also a button to remove it. All lessons with homework have a different color from the main one.</li><li>A web application platform into which all services will be integrated. It has: a header with the name of the application and a menu (an icon with a pull-down menu with an exit button); a side menu that collapses on mobile devices and opens when you click on the button in the header; place for other services. At the time of requesting data, the server displays a loader.</li><li>Authorization is represented by a simple form with two fields: login, password, and a login button. This is displayed when invalid data is entered.</li></ul>"
    },
    {
      "title": "🤴ℹ️ \"Alexander Nevsky\"",
      "descriptionShort": "Information and educational project \"Alexander Nevsky\". The site has various articles, a card file, a test, an interview. Of the Features: there is a parallax, a dynasty tree, interactive information about ammunition and much more.",
      "descriptionLong": "<h4>✨ About the project</h4> <p>Imposition of the information and educational project \"Alexander Nevsky\". The site has various articles, a card file, a test, an interview. Of the Features: there is a parallax effect, a dynasty tree adapted for mobile devices, interactive information about ammunition and much more.</p> <p>A group project! I made the pages: home, Rurikovichi, politician and diplomat, the path of history: quest, combat ammunition of the XIII century, partners, forks on the pages of sections; section about the project; section memory and honor; parallax. Ready-made libraries were used here and code for some animation was provided.</p> <h4>✨ Features</h4> <ul> <li>parallax effect</li> <li>dynasty tree adapted for mobile devices</li> <li>interactive ammunition info</li> <li>scroll button</li> <li>accordion</li> <li>sliding menu</li> <li>ie supported</li> <li>breadcrumbs </li> </ul>"
    },
    {
      "title": "🏫📑 School e-testing",
      "descriptionShort": "School project: automated knowledge control system for distance learning. Creation of groups, tests with different types of tasks, passing them and viewing the results.",
      "descriptionLong": "<h4>✨ About the project</h4><p>School project: automated knowledge control system for distance learning. Creation of groups, tests with different types of tasks, passing them and viewing the results.</p><h4>✨ System functionality</h4><h5>General information</h5><ul><li>Separate rights registration and authorization</li><li>Tests are filtered by classes and subjects, there are pagination</li><li>The student can view the errors in the test if the teacher allows this</li><li>Types of tasks: single-choice, multi-choice, free entry, matching</li><li>Test setup Features: different grading scale, limiting student's view of errors, randomizing response options, randomizing questions</li><li>When a student passes a test, a timer appears showing the remaining time.The test can be completed when the student submits by clicking on the &ldquo button 'complete the test' or at the end of the allotted time. The 'save' button is needed for safety net in case the browser page is reloaded. If the user leaves the test passing page without sending the results, then the teacher in the 'result' column taty&rdquo; a message will appear stating that the student did not complete the test.</li><li>Change username, email, password</li></ul><h5>Teacher options</h5><ul><li>Create, deleting, editing groups</li><li>Adding, deleting group members</li><li>Viewing your own and all tests</li><li>Creating, deleting, editing tests</li><li>Adding tasks for tests</li><li>Assign tests to groups to take</li><li>View results by test and group with student responses</li></ul><h5>Student options</h5><ul ><li>View your groups</li><li>View assigned and all tests</li><li>View results for tests</li><li>Passing tests</li></ul>"
    },
    {
      "title": "🏫📝 Applicant's personal account",
      "descriptionShort": "Student's personal account. Online sending of all documents and filling in all the necessary information. Tracking the rating for selected specialties.",
      "descriptionLong": "<h4>✨ About the project</h4><p>Student's personal account. Online sending of all documents and filling in all the necessary information. Tracking the rating for selected specialties. Pair project.</p>"
    }
  ],
  "hi": "Say Hi, it's free)",
  "more": "More",
  "View demo": "View Demo"
}
