{
  "Portfolio": "Портфолио",
  "five": "Дай пять!",
  "contacts": "Контакты",
  "projects": "Проекты",
  "achievementsTitle": "Достижения и сертификаты",
  "contributionTitle": "Активность",
  "achievements": [
    {
      "title": "Открытый региональный чемпионат «Молодые профессионалы» (WorldSkills Russia) по Челябинской области, веб-дизайн и разработка",
      "content": [
        "2019 - Победитель - юниоры",
        "2020 - Призер - основная категория"
      ]
    },
    {
      "title": "IT школа samsung. Бесплатная программа дополнительного образования по мобильной разработке для старшеклассников.",
      "content": [
        "2018-2019 Учебный год"
      ]
    }
  ],
  "projectsArray": [
    {
      "title": "🏫💻 Сайт факультета ИКТ",
      "descriptionShort": "Сайт является визитной карточкой факультета ИКТ ИТМО. Сайт предоставляет доступную информацию о деятельности факультета, дисциплинах и преподавателях.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Факультет инфокоммуникационных технологий является основной отправной точкой в ​​развитии профессиональных навыков. Сайт является визитной карточкой ИТМО факультета ИКТ. При переходе на сайт абитуриент или его родители должны иметь представление о том, что это за факультет и какова его специализация. Сайт содержит доступную информацию о деятельности, информацию о дисциплинах и преподавателях. Также есть страницы для администрирования.</p> <h4>🗺️ Карта</h4><p><strong> Основные</strong></p> <ul> <li>главная</li> <ul> <li>статьи</li> </ul> <li>события</li> <ul> <li>все новости</li> <li>события, новости, анонсы</li> </ul> <li>студентам</li> <ul> <li>статьи</li> </ul> <li>поступление</li> <ul> <li>перечень направлений для магистратуры, бакалавриата</li> <ul> <li>страницы направлений</li> <ul> <li>дисциплины направления</li> </ ul> </ul> </ul> <li>контакты</li> </ul> <p><strong>Панель администратора</strong></p> <ul> <li>страница входа</li> <li>опубликованное</li> <ul> <li>редактирование</li> </ul> <li>создать запись</li> <li>избранное</li> <ul> <li>редактирование</li> </ul> <li>теги</li> </ul> <h4>✨ Возможности</h4><ul> <li>темная и светлая тема</li> <li>анимация:</li> <ul> <li>вращающиеся шестиугольники с отображением текста</li> <li>карусель с всплывающим овалом с текстом</li> <li>стрелка, движущаяся по дороге и проходящая знаки, при достижении которых появляется текст. В конце пути находится книга, меняющая положение и текст</li> <li>плавное появление элементов при прокрутке</li> <li>линии, выходящие из сторон страницы</li> <li>блок с перемещением фотографий по овалам с эффектом наведения</li> </ul> <li>админ:</li> <ul> <li>обрезка фотографий при загрузке</li> <li>изменение формата фотографий при предварительном просмотре блоков (двойной и слайдер)</li> <li>предварительный просмотр поста, предварительный просмотр блоков для статей, которые будут вести к самой статье на страницах</li> <li>шесть типов настраиваемых блоков в создании поста ( два блока, текст, изображение, слайдер, цитата, подзаголовок)</li> <li>перетаскиваемые блоки</li> </ul> <li>пагинация, поиск, фильтрация новостей</li> <li>карусели:</li> <ul> <li>с овальными блоками</li> <li>с 6 (4) изображениями в две строки</li> <li>с 4 (2) эффектом увеличения при наведении</li> <li>с 1 изображение и высотой подогнанной под первое в очереди</li> </ul> <li>expansion-panel с исходящими линиями</li> </ul>"
    },
    {
      "title": "🖨️🐒 Вебсайт в ретро стиле",
      "descriptionShort": "Сайт с поноэкранным слайдером, появлением элементов, разной анимацией: печатающая машинка,  обезьяна в шляпе едущая по появляющейся дороге на одноколесном велосипеде, появление надписи, парящий аэростат.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Сайт с поноэкранным слайдером, появлением элементов, разной анимацией: печатающая старинная машинка,  обезьяна в шляпе едущая по появляющейся дороге на одноколесном велосипеде, появление надписи, парящий аэростат.</p><h4>✨ Возможности</h4> <ul> <li>полноэкранный слайдер</li> <li>анимация аэростата</li> <li>анимация надписи</li> <li>анимация пишущей машинки</li> <li>парящие ноты</li> <li>анимация обезьяны в шляпе на одноколесном велосипеде по появляющейся дорожке</li> <li>анимация старого телефона</li> </ul>"
    },
    {
      "title": "📝📅  Контроль проектов",
      "descriptionShort": "Создавайте проекты, ищите участников на определенную позицию, делите между ними задачи и просматривайте прогресс на канбан-доске. Также присоединяйтесь к любым другим проектам самостоятельно.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Создавайте проекты, ищите участников на определенную роль, распределяйте между ними задачи и просматривайте прогресс на канбан-доске. Также присоединяйтесь к любым другим проектам самостоятельно.</p><h4>✨ Возможности</h4><ul> <li>авторизация, регистрация, изменение профиля</li> <li>создание проекта, добавление ролей в проект, поиск участников на эти роли (заявки от пользователей или от создателя)</li> <li>красивая канбан-доска для проекта, добавление и изменение задач, изменение статуса участником задачи или создателем проекта, отметка горящих задач</li> <li>просмотр (некоторое с пагинацией)</li> <ul> <li>всех проектов с возможностью присоединиться к нему</li> <li>всех пользователей с возможностью добавления их в свои проекты</li> <li>ваших приложений</li> <li>проектов, в которых вы являетесь участником</li> </ul> <li>темная и светлая темы</li> <li>аватарки для пользователей по первым буквам имени с уникальным цветом</li> </ul>"
    },
    {
      "title": "🌥️❄️ Погода",
      "descriptionShort": "Приложение, которое показывает погоду по геолокации или по выбранному в настройках городу. Просматривайте погоду в других городах России и добавляйте их в избранное (краткий и полный отчет).",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Приложение, показывающее погоду по геолокации или по выбранному в настройках городу. Просматривайте погоду в других городах России и добавляйте их в избранное (краткий и полный отчет).</p><h4>✨ Возможности</h4><ul><li>отображение погоды по геолокации или по выбранному городу в настройках</li> <li>поиск погоды по городам россии, добавление их в избранное</li> <li>полный отчет о погоде с возможностью просмотра деталей по часам или дням</li> <li>кнопка обновления информации</li> <li>каркасная предзагрузка</li> <li>подсказки с описанием информации</li> <li>изменение единиц измерения</li> <li>разные изображения для погоды</li> <li>прогрессивное веб приложение</li> </ul>"
    },
    {
      "title": "📝📅  Трекер задач",
      "descriptionShort": "Создавайте спринты, добавляйте к ним задачи. Отслеживайте процесс, фильтруя по приоритету/названию/дате создания/дедлайну или в таблице по статусу задачи. Если вас утомил длинный список задач, просто расслабьтесь: посмотрите на собак.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Создавайте спринты, добавляйте в них задачи. Отслеживайте процесс, фильтруя по приоритету/названию/дате создания/дедлайну, или в таблице по статусу задачи. Если вас утомил длинный список задач, просто расслабьтесь: посмотрите на собачек.</p> <h4>✨ Возможности</h4> <ul> <li>создавание/редактирование задачи, спринты</li> <li>страница бэклога</li> <li>перетаскивание задач в спринты</li> <li>страница спринтов: два типа отображения спринта:</li> <ul> <li>первая представляет собой список всех задач, отфильтрованных по приоритету, названию, дате создания, сроку выполнения</li> <li>вторая представляет собой таблицу с задачами отфильтрованными по статусу задачи</li> </ul> <li>использование локального хранилища для сохранения всех объектов проекта</li> <li>страница отдыха с фотографиями и видео собак</li> </ul>"
    },
    {
      "title": "👨‍🔬🦹‍♂️ Рик и Морти",
      "descriptionShort": "Приложение, показывающее информацию о персонажах, локациях, эпизодах сериала Рик и Морти с поиском, фильтрацией, пагинацией. Вам будет легко найти информацию благодаря ссылкам в каждом из разделов на конкретные места.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Приложение, показывающее информацию о персонажах, локациях, эпизодах сериала Рик и Морти с поиском, фильтрацией, пагинацией. Вам будет легко найти информацию благодаря ссылкам в каждом из разделов на конкретные места.</p><h4>✨ Возможности</h4> <ul> <li>показывает некоторую статистику об общем количестве </li><ul>  <li>персонажей</li> <li>мест</li> <li>эпизодов</li> </ul> <li>фильтрация, пагинация, поиск</li> <li>светлая и темная темы</li> <li>pwa</li> </ul>"
    },
    {
      "title": "👩‍🎓📋 Суперапп для студентов",
      "descriptionShort": "Групповой курсовой проект. Мной сделан сервис расписания с возможностью добавления домашних заданий, авторизация, меню. Приложение адаптировано для мобильных телефонов.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Групповой курсовой проект. Мной сделан сервис расписания с возможностью добавления домашних заданий, авторизация, меню. Приложение адаптировано для мобильных телефонов.</p><h4>✨ Возможности</h4><ul><li>В расписании есть возможность выбора даты (неделя для гаджетов с большим экраном, день ‒ для телефонов) и отображение всей информации, которая соответствует этой дате. В таблице для гаджетов с большим экраном отображаются: в заголовках таблицы&nbsp;‒ дни недели, дата; в первой колонке ‒ время пары; в остальных ячейках информация о паре. При нажатии на эти ячейки отражается вся информация о паре в модальном окне. Для мобильных устройств отражается блок со всеми днями неделями и их датами. После следуют блоки с информацией о паре, при нажатии на которые появляется такое же модальное окно, как и на устройствах с большим экраном. Если в выбранную дату нет пар, то об этом есть сообщение.</li><li>Инструмента для добавления домашнего задания. При нажатии на пару без домашнего задания должна быть форма для его добавления с полем текста задания и кнопкой для добавления. При отправке пустого значения отображается ошибка. При нажатии на пару с домашним заданием оно отображается. Также есть кнопка для его удаления. Все пары с домашним заданием имеют цвет, отличающийся от основного.</li><li>Платформа веб-приложения, в которую будут интегрироваться все сервисы. В ней есть: шапка с названием приложение и меню (иконка с разворачивающимся меню с кнопкой выхода); боковое меню, сворачивающееся на мобильных устройствах и раскрывающееся при нажатии на кнопку в шапке; место для остальных сервисов. На момент запроса данных у сервера отображается лоадер.</li><li>Авторизация представленная простой формой с двумя полями: логин, пароль, и кнопкой входа. При введении неверных данных это отображается.</li></ul>"
    },
    {
      "title": "🤴ℹ️ \"Александр Невский\"",
      "descriptionShort": "Информационно-образовательный проект \"Александр Невский\". На сайте есть разные статьи, картотека, тест, интервью. Из особенностей: есть параллакс, дерево династии, интерактивная информация об амуниции и др.",
      "descriptionLong": "<h4>✨ О проекте</h4> <p>Верстка информационно-образовательный проекта \"александр невский\". На сайте есть разные статьи, картотека, тест, интервью. Из особенностей: есть эффект параллакса, дерево династии адаптированное под мобильный устройства, интерактивная информация об амуниции и многое другое.</p> <p>Проект групповой! Мной сделаны страницы: главная, рюриковичи, политик и дипломат, путь истории: квест, боевая амуниция xiii века, партнеры, развилки на страницы разделов; раздел о проекте;раздел память и почесть; параллакс. Здесь использовались готовые библиотеки и предоставлялся код к некоторой анимации.</p> <h4>✨ Особенности</h4> <ul> <li>эффект параллакса</li> <li>дерево династии адаптированное под мобильный устройства</li> <li>интерактивная информация об амуниции</li> <li>кнопка прокрутки</li> <li>аккордион</li> <li>выдвигающееся меню</li> <li>поддерживается ie</li> <li>хлебные крошки</li> </ul>"
    },
    {
      "title": "🏫📑 Школьное электронное тестирование",
      "descriptionShort": "Школьный проект: система автоматизированного контроля знаний при дистанционной форме обучения. Создание групп, тестов с разными типами заданий, их прохождение и просмотр результатов.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Школьный проект: система автоматизированного контроля знаний при дистанционной форме обучения. Создание групп, тестов с разными типами заданий, их прохождение и просмотр результатов.</p><h4>✨ Возможности</h4><h5>Общие сведения</h5><ul><li>Регистрация и авторизация с разделением прав</li><li>Тесты фильтруются по классам и предметам, есть пагинация</li><li>Ученик может просматривать ошибки в тесте, если учитель даёт такую возможность</li><li>Типы заданий: одновариантный, многовариантный, свободный ввод, соответствие</li><li>Особенности настройки теста: разная шкала оценивания, ограничение просмотра ошибок учеником, вывод вариантов ответа в случайном порядке, вывод вопросы в случайном порядке</li><li>При прохождении теста учеником появляется таймер, показывающий оставшееся время. Тест может быть завершен при отправке учеником по нажатию на кнопку &ldquo;завершить тест&rdquo; или по окончании отведенного времени. Кнопка &ldquo;сохранить&rdquo; нужна для подстраховки в том случае, если страница браузера будет перезагружена. В случае если пользователь покинет страницу прохождения теста, не отправив результаты, то у учителя в графе &ldquo;результаты&rdquo; появится сообщение о том, что ученик не завершил тест.</li><li>Изменение имени, почты, пароля пользователя</li></ul><h5>Возможности учителей</h5><ul><li>Создание, удаление, изменение групп</li><li>Добавление, удаление участников группы</li><li>Просмотр своих и всех тестов</li><li>Создание, удаление, изменение тестов</li><li>Добавление заданий для тестов</li><li>Назначение тестов группам для прохождения</li><li>Просмотр результатов по тестам и группам с просмотром ответов учащихся</li></ul><h5>Возможности учеников</h5><ul><li>Просмотр своих групп</li><li>Просмотр заданных и всех тестов</li><li>Просмотр результатов за тесты</li><li>Прохождение тестов</li></ul>"
    },
    {
      "title": "🏫📝 Личный кабинет абитуриента",
      "descriptionShort": "Личный кабинет абитуриента. Онлайн отправка всех документов и заполнение всей необходимой информации. Слежение за рейтингом на выбранные специальности.",
      "descriptionLong": "<h4>✨ О проекте</h4><p>Личный кабинет абитуриента. Онлайн отправка всех документов и заполнение всей необходимой информации. Слежение за рейтингом на выбранные специальности. Парный проект. </p>"
    }
  ],
  "hi": "Напиши Привет, это бесплатно)",
  "more": "Больше",
  "View demo": "Демо"
}
